Revit 2027 API
StirrupTieAttachmentType Enumeration
 An enumerated tye that represents how the Stirrup/Tie rebar is attached to the cover reference.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StirrupTieAttachmentType
Public Enumeration StirrupTieAttachmentType
public enum class StirrupTieAttachmentType
type StirrupTieAttachmentType
Members
Member name | Value | Description
ExteriorFace | 1 |  Designate Stirrup/Tie rebar to attach to exterior face of cover reference.
InteriorFace | 0 |  Designate Stirrup/Tie rebar to attach to interior face of cover reference.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace